Catalogs/СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СобытияОС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытияОС</Name>
					<Comment>Вид события с ОС</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СобытияОСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СобытияОСОрганизаций</Name>
			<Comment>(Регл) Регистр, который отражает события, происходящие с ОС в организациях. Данные вносятся только документами. По этому регистру ведется анализ даты модернизации, перемещения и проч.</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СобытияОС/Ext/ObjectModule.bsl
//После того, как событие выбрано в документ,
//его можно свободно отредактировать так, что для данного документа оно не подходит.
//Добавлена проверка того, были ли движения по данному событию
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция проверяет, были ли движения по регистру 
// с текущим событием
//
Функция БылиДвиженияПоРегистрам()

	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	 |	СобытияОСОрганизаций.Событие
	 |ИЗ
	 |	РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
	 |ГДЕ
	 |	СобытияОСОрганизаций.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Событие", Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции // БылиДвиженияПоРегистру()

// Процедура проверяет, существуют ли движения в регистрах по данному
// элементу справочника. Если существуют и изменялись определенные реквизиты,
// то запрещает запись.
Процедура ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок)

	Если ЭтоНовый() или ОбменДанными.Загрузка Тогда
		
		// Проверять нечего
		Возврат
		
	КонецЕсли;
	
	// Получение старых значений
	ВидСобытияОССтарый  = Ссылка.ВидСобытияОС;
	// Проверка изменений
	ИзмененВидСобытияОС = (ВидСобытияОС <> ВидСобытияОССтарый);
	
	Если ИзмененВидСобытияОС Тогда
		
		Если БылиДвиженияПоРегистрам() Тогда
			
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='	Нельзя изменять ""Вид события ОС"", потому что были движения по регистру ""События ОС организаций""."
"	Текущее значение <%1> изменяется на старое <%2>.';uk='	Не можна змінювати ""Вид події ОЗ"", тому що були рухи по регістру ""Події ОЗ організацій""."
"	Поточне значення <%1> змінюється на старе <%2>.'"), ВидСобытияОС, ВидСобытияОССтарый);
			ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ, Заголовок);
			ВидСобытияОС = ВидСобытияОССтарый
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ПроверитьВозможностьЗаписиЭлемента()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Запись элемента справочника ""%1"" Наим: <%2> код: <%3>:';uk='Запис елемента довідника ""%1"" Найм: <%2> код: <%3>:'"), Метаданные().Представление(), Наименование, Код);
				
	ПроверитьВозможностьЗаписиЭлемента(Отказ, Заголовок)
	
КонецПроцедуры
